Revit 2026 API

# ZoneServiceType Property

---

**Note: This API is now obsolete.**

Get or set the Service Type of the Zone.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
public ServiceType ServiceType { get; set; }
```
```vb
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>
Public Property ServiceType As ServiceType
	Get
	Set
```
```cpp
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
property ServiceType ServiceType {
	ServiceType get ();
	void set (ServiceType value);
}
```
```fsharp
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>]
member ServiceType : ServiceType with get, set
```

#### Property Value

ServiceType

This property is used to get or set the Service Type of the Zone.

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace